{
  "Engineering": [
    {
      "title": "Microservices AntiPatterns and Pitfalls",
      "link": "https://www.goodreads.com/book/show/31291348-microservices-antipatterns-and-pitfalls",
      "authors": "Mark Richards",
      "description": "With this concise ebook, author Mark Richards walks you through the ten most common microservice anti-patterns and pitfalls, and provides solutions for avoiding them."
    },
    {
      "title": "Effective Go",
      "link": "https://golang.org/doc/effective_go.html",
      "authors": "Go",
      "description": "Tips for writing clear, idiomatic Go code"
    },
    {
      "title": "Concurrency in Go",
      "link": "https://www.goodreads.com/book/show/30413199-concurrency-in-go",
      "authors": "Katherine Cox-Buday",
      "description": "Concurrency can be notoriously difficult to get right, but fortunately, the Go open source programming language makes working with concurrency tractable and even easy. If you're a developer familiar with Go, this practical book demonstrates best practices and patterns to help you incorporate concurrency into your systems."
    },
    {
      "title": "Software Architecture Patterns",
      "link": "https://www.goodreads.com/book/show/25091671-software-architecture-patterns",
      "authors": "Mark Richards",
      "description": "Deep dive into many common software architecture patterns. Each pattern includes a full explanation of how it works, explains the pattern’s benefits and considerations, and describes the circumstances and conditions it was designed to address."
    },
    {
      "title": "Patterns of Enterprise Application Architecture",
      "link": "https://www.goodreads.com/book/show/70156.Patterns_of_Enterprise_Application_Architecture",
      "authors": "Martin Fowler",
      "description": "Developers of enterprise applications (e.g reservation systems, supply chain programs, financial systems, etc.) face a unique set of challenges, different than those faced by their desktop system and embedded system peers. For this reason, enterprise developers must uncover their own solutions. In this new book, noted software engineering expert Martin Fowler turns his attention to enterprise application development. He helps professionals understand the complex   yet critical   aspects of architecture."
    },
    {
      "title": "Microservices vs Service Oriented Architecture",
      "link": "https://www.oreilly.com/programming/free/files/microservices-vs-service-oriented-architecture.pdf",
      "authors": "Mark Richards",
      "description": "For anyone who has been developing web applications for 10 years or more, the recent rise of microservices sounds a lot like a development approach we already knew service oriented architecture (SOA). Both architectures are focused on breaking up large monolithic applications into collections of smaller independent services, and both come with the promise of simplifying development."
    },
    {
      "title": "Effective Scala",
      "link": "https://twitter.github.io/effectivescala/",
      "authors": "Marius Eriksen",
      "description": "While highly effective, Scala is also a large language, and our experiences have taught us to practice great care in its application. What are its pitfalls? Which features do we embrace, which do we eschew? When do we employ purely functional style, and when do we avoid it? In other words: what have we found to be an effective use of the language? This guide attempts to distill our experience into short essays, providing a set of best practices."
    },
    {
      "title": "Domain Driven Design",
      "link": "https://www.goodreads.com/book/show/179133.Domain_Driven_Design",
      "authors": "Eric Evans",
      "description": "Eric Evans has written a fantastic book on how you can make the design of your software match your mental model of the problem domain you are addressing."
    },
    {
      "title": "Domain Driven Design Quickly",
      "link": "https://www.infoq.com/minibooks/domain-driven-design-quickly/",
      "authors": "InfoQ",
      "description": "Domain Driven Design Quicklyis a short, quick-readable summary and introduction to the fundamentals of DDD."
    },
    {
      "title": "Refactoring: Improving the Design of Existing Code",
      "link": "https://www.goodreads.com/book/show/44936.Refactoring",
      "authors": "Martin Fowler, Kent Beck, Don Roberts",
      "description": "As the application of object technology particularly the Java programming language has become commonplace, a new problem has emerged to confront the software development community. Significant numbers of poorly designed programs have been created by less-experienced developers, resulting in applications that are inefficient and hard to maintain and extend. Increasingly, software system professionals are discovering just how difficult it is to work with these inherited, non-optimal applications."
    },
    {
      "title": "Don't Make Me Think",
      "link": "https://www.goodreads.com/book/show/18197267-don-t-make-me-think-revisited",
      "authors": "Steve Krug",
      "description": "This is a book about Web design principles rather than Web design technology. The author is a Web design expert. has a wealth of practical experience. He uses humor to reveal the language of your Web design is important but easily overlooked problem. just a few hours. you will be able to control the design principles taught in the book to find the crux of website design."
    },
    {
      "title": "Clean Architecture",
      "link": "https://www.goodreads.com/book/show/18043011-clean-architecture",
      "authors": "Robert C. Martin",
      "description": "Building upon the success of best-sellers The Clean Coder and Clean Code, legendary software craftsman Uncle Bob shows how to bring greater professionalism and discipline to application architecture and design."
    },
    {
      "title": "Enterprise Integration Patterns",
      "link": "https://www.goodreads.com/book/show/85012.Enterprise_Integration_Patterns",
      "authors": "Martin Fowler, Gregor Hohpe, Bobby Woolf",
      "description": "Enterprise Integration Patterns provides an invaluable catalog of sixty-five patterns, with real-world solutions that demonstrate the formidable of messaging and help you to design effective messaging solutions for your enterprise. The authors also include examples covering a variety of different integration technologies, such as JMS, MSMQ, TIBCO ActiveEnterprise, Microsoft BizTalk, SOAP, and XSL. A case study describing a bond trading system illustrates the patterns in practice, and the book offers a look at emerging standards, as well as insights into what the future of enterprise integration might hold. This book provides a consistent vocabulary and visual notation framework to describe large-scale integration solutions across many technologies. It also explores in detail the advantages and limitations of asynchronous messaging architectures."
    },
    {
      "title": "Continuous Integration: Improving Software Quality and Reducing Risk",
      "link": "https://www.goodreads.com/book/show/1311542.Continuous_Integration",
      "authors": "Paul Duvall, Steve Matyas, Andrew Glover",
      "description": "For any software developer who has spent days in integration hell, cobbling together myriad software components, Continuous Integration: Improving Software Quality and Reducing Risk illustrates how to transform integration from a necessary evil into an everyday part of the development process. The key, as the authors show, is to integrate regularly and often using continuous integration (CI) practices and techniques."
    },
    {
      "title": "The TypeScript Handbook",
      "link": "https://www.typescriptlang.org/docs/handbook/intro.html",
      "authors": "TypeScript",
      "description": "If you have experience in other languages, you should be able to pick up JavaScript syntax quite quickly by reading the handbook."
    },
    {
      "title": "Build APIs You Won't Hate",
      "link": "https://www.goodreads.com/book/show/18981361-build-apis-you-won-t-hate",
      "authors": "Phil Sturgeon",
      "description": "Tasked with building an API for your company but don't have a clue where to start? Taken over an existing API and hate it? Built your own API and still hate it? This book is for you."
    },
    {
      "title": "The Pragmatic Programmer",
      "link": "https://www.goodreads.com/book/show/4099.The_Pragmatic_Programmer",
      "authors": "Andy Hunt, Dave Thomas",
      "description": "Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process taking a requirement and producing working, maintainable code that delights its users."
    },
    {
      "title": "Domain-Specific Languages",
      "link": "https://www.goodreads.com/book/show/8082269-domain-specific-languages",
      "authors": "Martin Fowler",
      "description": "When carefully selected and used, Domain-Specific Languages (DSLs) may simplify complex code, promote effective communication with customers, improve productivity, and unclog development bottlenecks. In Domain-Specific Languages , noted software development expert Martin Fowler first provides the information software professionals need to decide if and when to utilize DSLs. Then, where DSLs prove suitable, Fowler presents effective techniques for building them, and guides software engineers in choosing the right approaches for their applications."
    },
    {
      "title": "The Algorithm Design Manual",
      "link": "https://www.goodreads.com/book/show/425208.The_Algorithm_Design_Manual",
      "authors": "Steven S. Skiena",
      "description": "This volume helps take some of the mystery out of identifying and dealing with key algorithms. Drawing heavily on the author's own real-world experiences, the book stresses design and analysis. Coverage is divided into two parts, the first being a general guide to techniques for the design and analysis of computer algorithms. The second is a reference section, which includes a catalog of the 75 most important algorithmic problems. By browsing this catalog, readers can quickly identify what the problem they have encountered is called, what is known about it, and how they should proceed if they need to solve it."
    },
    {
      "title": "Javascript: The Good Parts",
      "link": "https://www.goodreads.com/book/show/2998152-javascript",
      "authors": "Douglas Crockford",
      "description": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined."
    },
    {
      "title": "Scaling PHP Applications",
      "link": "https://www.goodreads.com/book/show/21386348-scaling-php-applications",
      "authors": "Stephen Corona",
      "description": "I(author) spent 3 years scaling Twitpic to over 60 million visitors and 20 billion HTTP Requests. I'm sharing everything I've learnt in this ebook so you can skip over the trial-and-error and head straight to the techniques."
    },
    {
      "title": "Design Patterns: Elements of Reusable Object-Oriented Software",
      "link": "https://www.goodreads.com/book/show/85009.Design_Patterns",
      "authors": "Erich Gamma, Ralph Johnson, John Vlissides, Richard Helm",
      "description": "Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves."
    },
    {
      "title": "Clean Code",
      "link": "https://www.goodreads.com/book/show/3735293-clean-code",
      "authors": "Robert C. Martin",
      "description": "Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way."
    },
    {
      "title": "Structure and Interpretation of Computer Programs",
      "link": "https://www.goodreads.com/book/show/43713.Structure_and_Interpretation_of_Computer_Programs",
      "authors": "Harold Abelson, Gerald Jay Sussman, Julie Sussman",
      "description": "Structure and Interpretation of Computer Programs has had a dramatic impact on computer science curricula over the past decade. This long-awaited revision contains changes throughout the text. There are new implementations of most of the major programming systems in the book, including the interpreters and compilers, and the authors have incorporated many small changes that reflect their experience teaching the course at MIT since the first edition was published."
    },
    {
      "title": "Azure Architecture Center",
      "link": "https://docs.microsoft.com/en-us/azure/architecture/",
      "authors": "Microsoft",
      "description": "Guidance for architecting solutions on Azure using established patterns and practices. Not a book, but great summaries and documents."
    },
    {
      "title": "A curated list of free programming books and papers",
      "link": "https://github.com/EbookFoundation/free-programming-books/blob/master/books/free-programming-books.md",
      "authors": "EbookFoundation",
      "description": "This one is just an extra link here. I haven't read most of them myself, but I found a few interesting ones that I will not link them individually here. Open the list and you may find something interesting there."
    }
  ],
  "Other books": [
    {
      "title": "An Elegant Puzzle",
      "link": "https://www.goodreads.com/book/show/45303387-an-elegant-puzzle",
      "authors": "Will Larson",
      "description": "There's a saying that people don't leave companies, they leave managers. Management is a key part of any organization, yet the discipline is often self-taught and unstructured. Getting to the good solutions of complex management challenges can make the difference between fulfillment and frustration for teams, and, ultimately, the success or failure of companies."
    },
    {
      "title": "The Hard Thing About Hard Things",
      "link": "https://www.goodreads.com/book/show/18176747-the-hard-thing-about-hard-things",
      "authors": "Ben Horowitz",
      "description": "A lot of people talk about how great it is to start a business, but only Ben Horowitz is brutally honest about how hard it is to run one."
    },
    {
      "title": "The Simple Path to Wealth",
      "link": "https://www.goodreads.com/book/show/30646587-the-simple-path-to-wealth",
      "authors": "J.L. Collins",
      "description": "In the dark, bewildering, trap-infested jungle of misinformation and opaque riddles that is the world of investment, JL Collins is the fatherly wizard on the side of the path, offering a simple map, warm words of encouragement and the tools to forge your way through with confidence. You'll never find a wiser advisor with a bigger heart.   Malachi Rempen: Filmmaker, cartoonist, author and self-described ruffian"
    },
    {
      "title": "The Barefoot Investor",
      "link": "https://www.goodreads.com/book/show/33121747-the-barefoot-investor",
      "authors": "Scott Pape",
      "description": "This book will show you how to create an entire financial plan that is so simple you can sketch it on the back of a serviette and you'll be able to manage your money in 10 minutes a week."
    },
    {
      "title": "Rich Dad Poor Dad",
      "link": "https://www.goodreads.com/book/show/69571.Rich_Dad_Poor_Dad",
      "authors": "Robert T. Kiyosaki, Sharon Lechter",
      "description": "Rich Dad Poor Dad is Robert's story of growing up with two dads his real father and the father of his best friend, his rich dad   and the ways in which both men shaped his thoughts about money and investing. The book explodes the myth that you need to earn a high income to be rich and explains the difference between working for money and having your money work for you."
    },
    {
      "title": "The Richest Man in Babylon",
      "link": "https://www.goodreads.com/book/show/1052.The_Richest_Man_in_Babylon",
      "authors": "George S. Clason",
      "description": "Beloved by millions, this timeless classic holds the key to all you desire and everything you wish to accomplish. This is the book that reveals the secret to personal wealth. The Success Secrets of the Ancients. An Assured Road to Happiness and Prosperity."
    },
    {
      "title": "The Millionaire Next Door",
      "link": "https://www.goodreads.com/book/show/998.The_Millionaire_Next_Door",
      "authors": "Thomas J. Stanley",
      "description": "Who are the rich in this country? Get the answers in The Millionaire Next Door, the never-before-told story about wealth in America. You'll be surprised at what you find out."
    },
    {
      "title": "Essentialism",
      "link": "https://www.goodreads.com/book/show/18077875-essentialism",
      "authors": "Greg McKeown",
      "description": "Essentialism is not one more thing – it’s a whole new way of doing everything. A must-read for any leader, manager, or individual who wants to learn who to do less, but better, in every area of their lives, Essentialism  is a movement whose time has come."
    },
    {
      "title": "Atomic Habits",
      "link": "https://www.goodreads.com/book/show/40121378-atomic-habits",
      "authors": "James Clear",
      "description": "No matter your goals, Atomic Habits offers a proven framework for improving every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results."
    },
    {
      "title": "Failing Forward",
      "link": "https://www.goodreads.com/book/show/628070.Failing_Forward",
      "authors": "John C. Maxwell",
      "description": "Failing Forward: Turning Mistakes into Stepping Stones for Success."
    },
    {
      "title": "The Lean Startup",
      "link": "https://www.goodreads.com/book/show/10127019-the-lean-startup",
      "authors": "Eric Ries",
      "description": "Most startups fail. But many of those failures are preventable. The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched."
    },
    {
      "title": "The Startup Playbook",
      "link": "https://www.goodreads.com/book/show/15788880-the-startup-playbook",
      "authors": "David S. Kidder",
      "description": "According to the Kauffman Index of Entrepreneurial Activity, more than 565,000 new businesses were created in 2010 in the United States alone each one of them hoping to strike gold. The Startup Playbook will help them succeed. Going insider to insider with unprecedented access, New York Times bestselling author and Clickable CEO, David Kidder, shares the hard-hitting experiences of some of the world's most influential entrepreneurs and CEOs, revealing their most closely held advice. Face-to-face interviews with 40 founders give readers key insights into what it took to build PayPal, LinkedIn, AOL, TED, Flickr, and many others into household names."
    },
    {
      "title": "Wired to Care",
      "link": "https://www.goodreads.com/book/show/5749206-wired-to-care",
      "authors": "Dev Patnaik",
      "description": "Empathy isn't about being touchy-feely. It's the ability to step outside of yourself and see the world as other people do. Empathy helps to make good leaders into great ones: they see new opportunities faster than their competitors, have the courage to take a risk on something new, and have the gut-level intuition that they need to make the right decisions when the path ahead is unclear."
    },
    {
      "title": "High Output Management",
      "link": "https://www.goodreads.com/book/show/324750.High_Output_Management",
      "authors": "Andrew S. Grove",
      "description": "In High Output Management, Andrew S. Grove, former chairman and CEO and employee number three of Intel, shares his perspective on how to build and run a company."
    },
    {
      "title": "The Art of War",
      "link": "https://www.goodreads.com/book/show/10534.The_Art_of_War",
      "authors": "Sun Tzu",
      "description": "Twenty-Five Hundred years ago, Sun Tzu wrote this classic book of military strategy based on Chinese warfare and military thought. Since that time, all levels of military have used the teaching on Sun Tzu to warfare and civilization have adapted these teachings for use in politics, business and everyday life. The Art of War is a book which should be used to gain advantage of opponents in the boardroom and battlefield alike."
    },
    {
      "title": "The 10x Rule",
      "link": "https://www.goodreads.com/book/show/10339170-the-10x-rule",
      "authors": "Grant Cardone",
      "description": "The 10 X Rule unveils the principle of Massive Action, allowing you to blast through business clichZs and risk-aversion while taking concrete steps to reach your dreams. It also demonstrates why people get stuck in the first three actions and how to move into making the 10X Rule a discipline. Find out exactly where to start, what to do, and how to follow up each action you take with more action to achieve Massive Action results."
    },
    {
      "title": "Eat That Frog!",
      "link": "https://www.goodreads.com/book/show/95887.Eat_That_Frog_",
      "authors": "Brian Tracy",
      "description": "The legendary Eat That Frog! (more than 450,000 copies sold and translated into 23 languages) provides the 21 most effective methods for conquering procrastination and accomplishing more. This new edition is revised and updated throughout, and includes brand new information on how to keep technology from dominating our time."
    }
  ],
  "Tech Podcasts": [
    {
      "title": "Software Engineering Daily",
      "link": "https://softwareengineeringdaily.com/",
      "authors": "Jeff Meyerson",
      "description": "Software Engineering Daily features daily interviews about technical software topics."
    },
    {
      "title": "InfoQ",
      "link": "https://www.infoq.com/the-infoq-podcast/",
      "authors": "InfoQ",
      "description": "Professional software development."
    },
    {
      "title": "Thoughtworks",
      "link": "https://www.thoughtworks.com/podcasts",
      "authors": "Thoughtworks",
      "description": "From deep technical topics to digital transformation and innovation, our podcasts feature captivating conversations on the latest in business and tech. Explore and listen in your own time, on the channel of your choice."
    },
    {
      "title": "Darknet Diaries",
      "link": "https://darknetdiaries.com/",
      "authors": "Jack Rhysider",
      "description": "True stories from the dark side of the Internet. This is a podcast about hackers, breaches, shadow government activity, hacktivism, cybercrime, and all the things that dwell on the hidden parts of the network. This is Darknet Diaries."
    },
    {
      "title": "Techmeme Ride Home",
      "link": "https://techmeme.com/techmeme-ride-home-itunes",
      "authors": "Brian McCullough",
      "description": "Daily tech news."
    },
    {
      "title": "Code[ish]",
      "link": "https://www.heroku.com/podcasts/codeish",
      "authors": "Heroku",
      "description": "A podcast from the team at Heroku, exploring code, technology, tools, tips, and the life of the developer."
    },
    {
      "title": "Inside Java",
      "link": "https://inside.java/",
      "authors": "Oracle",
      "description": "News and views from the Java team at Oracle."
    },
    {
      "title": "Go time",
      "link": "https://changelog.com/gotime",
      "authors": "Changelog",
      "description": "Weekly podcast with diverse discussions from around the Go community."
    },
    {
      "title": "Changelog",
      "link": "https://changelog.com/podcast",
      "authors": "Changelog",
      "description": "Conversations with the hackers, leaders, and innovators of the software world."
    },
    {
      "title": "Serverless Chats",
      "link": "https://www.serverlesschats.com/",
      "authors": "Jeremy Daly",
      "description": "Serverless Chats is a podcast designed to geek out on everything serverless."
    },
    {
      "title": "AWS Podcast",
      "link": "https://aws.amazon.com/podcasts/aws-podcast",
      "authors": "AWS",
      "description": "The Official AWS Podcast is a podcast for developers and IT professionals looking for the latest news and trends in storage, security, infrastructure, serverless, and more. Join Simon Elisha and Nicki Stone for regular updates, deep dives and interviews. Whether you’re training machine learning models, developing open source projects, or building cloud solutions, the AWS Podcast has something for you."
    }
  ],
  "Other Podcasts": [
    {
      "title": "Pessimists Archive",
      "link": "https://pessimists.co/",
      "authors": "Jason Feifer",
      "description": "A history of why we resist new things."
    },
    {
      "title": "Hardcore History",
      "link": "https://www.dancarlin.com/hardcore-history-series/",
      "authors": "Dan Carlin",
      "description": "Hardcore History is Carlin's forum for exploring topics throughout world history. The focus of each episode varies widely from show to show but they are generally centered on specific historical events and are discussed in a theater of the mind style. New episodes are released approximately every four to seven months."
    }
  ],
  "Newsletters": [
    {
      "title": "The Software Architects",
      "link": "https://www.infoq.com/software-architects-newsletter/",
      "authors": "InfoQ",
      "description": "The InfoQ Architects' Newsletter is your monthly guide to all the topics, technologies and techniques that every professional or aspiring software architect needs to know about."
    },
    {
      "title": "Software Lead Weekly",
      "link": "https://softwareleadweekly.com/",
      "authors": "Oren Ellenbogen",
      "description": "A weekly email for busy people who care about people, culture and leadership."
    },
    {
      "title": "StatusCode",
      "link": "https://weekly.statuscode.com/",
      "authors": "Cooperpress",
      "description": "Covering the week’s news in software development, infrastructure, ops, platforms, and performance."
    },
    {
      "title": "Serverless Status",
      "link": "https://serverless.email/",
      "authors": "Cooperpress",
      "description": "The newsletter features a mix of news, demos and interesting projects, highlighting what serverless can offer developers."
    },
    {
      "title": "Golang Weekly",
      "link": "https://golangweekly.com/",
      "authors": "Cooperpress",
      "description": "The most popular newsletter amongst the rapidly growing Go community."
    },
    {
      "title": "Node Weekly",
      "link": "https://nodeweekly.com/",
      "authors": "Cooperpress",
      "description": "Node related articles and links that were beginning to take over JavaScript Weekly’s issues at the time."
    },
    {
      "title": "JavaScript Weekly",
      "link": "https://javascriptweekly.com/",
      "authors": "Cooperpress",
      "description": "JavaScript Weekly is aimed at JavaScript developers and web developers with an interest in JavaScript, Angular, React, Node.js, and related technologies."
    },
    {
      "title": "Level Up",
      "link": "https://levelup.patkua.com/",
      "authors": "Patrick Kua",
      "description": "Curated newsletter for leaders in tech."
    }
  ]
}
